In [6]:
import numpy as np
import pandas as pd

## Creating pandas Series and DataFrame

In [7]:
marks_list=[55,25,75,40,90]
marks_arr=np.array(marks_list)

series_list=pd.Series(marks_list)
series_arr=pd.Series(marks_arr)
print(series_list)
print(series_arr)

0    55
1    25
2    75
3    40
4    90
dtype: int64
0    55
1    25
2    75
3    40
4    90
dtype: int32

In [10]:
#change label of series
label_series=pd.Series(marks_list,index=['A','B','C','D','E'])
label_series

A    55
B    25
C    75
D    40
E    90
dtype: int64

### Mathematical Operations on Pandas Series:

In [12]:
label_updated=label_series+2.5
label_updated

A    57.5
B    27.5
C    77.5
D    42.5
E    92.5
dtype: float64

In [16]:
print(label_updated-label_series)
print(label_series * 2)
print(label_series / 2)

A    2.5
B    2.5
C    2.5
D    2.5
E    2.5
dtype: float64
A    110
B     50
C    150
D     80
E    180
dtype: int64
A    27.5
B    12.5
C    37.5
D    20.0
E    45.0
dtype: float64

# DataFrame :

In [35]:
#Using LIST
student=["Mary","Himahsu","Tanish","Abhishek","vishal"]
df1=pd.DataFrame(student,columns=['Student'])
df1

    Student
0      Mary
1   Himahsu
2    Tanish
3  Abhishek
4    vishal

In [23]:
#Using dictionary
grades=['A',"A+","B","B+","C"]
df2=pd.DataFrame({"students":student,"Grade":grades})
df2

   students Grade
0      Mary     A
1   Himahsu    A+
2    Tanish     B
3  Abhishek    B+
4    vishal     C

In [26]:
print(type(df2))
print(type(df2["Grade"]))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [28]:
df2["num"]=[10,12,11,13,15]

In [30]:
df2

   students Grade  num
0      Mary     A   10
1   Himahsu    A+   12
2    Tanish     B   11
3  Abhishek    B+   13
4    vishal     C   15

In [32]:
#using Series:
year=pd.Series([2012,2013,2015,2016,2017,2018])
energy=pd.Series([53,296,17,22,80,96])
df3 = pd.DataFrame({"Year":year,"Energy":energy})
df3

   Year  Energy
0  2012      53
1  2013     296
2  2015      17
3  2016      22
4  2017      80
5  2018      96

In [36]:
#using random numbers
df4=pd.DataFrame(np.random.randn(5,2),columns=["Trial 1","Trial 2"])
df4

    Trial 1   Trial 2
0 -0.043442  1.388220
1  0.085969  0.236648
2  0.177393 -0.226381
3  0.364302  1.042039
4  0.595188  0.129800

# Accessing and Modifying Series:

In [42]:
label_series

A    55
B    25
C    75
D    40
E    90
dtype: int64

In [44]:
label_series["A"]

55

In [50]:
label_series[0]

55

In [55]:
label_series[:3]

A    55
B    25
C    75
dtype: int64

In [60]:
#acessing multiple elements
label_series[[0,2,3]]

A    55
C    75
D    40
dtype: int64

In [62]:
label_series[np.arange(1,3,1)]

B    25
C    75
dtype: int64

In [68]:
label_series[:"C"]

A    55
B    25
C    75
dtype: int64

In [70]:
label_series[["A","C","E"]]

A    55
C    75
E    90
dtype: int64

In [75]:
df2["roll"]=[123,124,125,126,127]

In [76]:
df2

   students Grade  num  roll
0      Mary     A   10   123
1   Himahsu    A+   12   124
2    Tanish     B   11   125
3  Abhishek    B+   13   126
4    vishal     C   15   127

In [86]:
df2["students"]

0        Mary
1     Himahsu
2      Tanish
3    Abhishek
4      vishal
Name: students, dtype: object

In [89]:
df2[1:5:2]

   students Grade  num  roll
1   Himahsu    A+   12   124
3  Abhishek    B+   13   126

In [90]:
df2[::-2]

  students Grade  num  roll
4   vishal     C   15   127
2   Tanish     B   11   125
0     Mary     A   10   123

In [91]:
df2["students"][[0,1,2,4]]

0       Mary
1    Himahsu
2     Tanish
4     vishal
Name: students, dtype: object

# Reshaping the DataFrame:

In [94]:
df2.stack()

0  students        Mary
   Grade              A
   num               10
   roll             123
1  students     Himahsu
   Grade             A+
   num               12
   roll             124
2  students      Tanish
   Grade              B
   num               11
   roll             125
3  students    Abhishek
   Grade             B+
   num               13
   roll             126
4  students      vishal
   Grade              C
   num               15
   roll             127
dtype: object

In [96]:
df2.unstack()

students  0        Mary
          1     Himahsu
          2      Tanish
          3    Abhishek
          4      vishal
Grade     0           A
          1          A+
          2           B
          3          B+
          4           C
num       0          10
          1          12
          2          11
          3          13
          4          15
roll      0         123
          1         124
          2         125
          3         126
          4         127
dtype: object

In [98]:
df2.melt()  #gets only variable and value i.e only 2 columns

    variable     value
0   students      Mary
1   students   Himahsu
2   students    Tanish
3   students  Abhishek
4   students    vishal
5      Grade         A
6      Grade        A+
7      Grade         B
8      Grade        B+
9      Grade         C
10       num        10
11       num        12
12       num        11
13       num        13
14       num        15
15      roll       123
16      roll       124
17      roll       125
18      roll       126
19      roll       127